#### AirHeatExchangerType Enumeration

---

|  |
| --- |
| See Also |

The type of air loop.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2020

# Syntax

| C# |
| --- |
| ``` public enum AirHeatExchangerType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration AirHeatExchangerType ``` |

| Visual C++ |
| --- |
| ``` public enum class AirHeatExchangerType ``` |

# Members

| Member name | Description |
| --- | --- |
| None |  |
| Enthalpy |  |
| Sensible |  |

# See Also

Autodesk.Revit.DB.Mechanical Namespace